Revit 2026 API

# PipeIsPipeTypeId Method

---

Checks if given type is valid pipe type.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsPipeTypeId(
	Document document,
	ElementId pipeTypeId
)
```
```vb
Public Shared Function IsPipeTypeId (
	document As Document,
	pipeTypeId As ElementId
) As Boolean
```
```cpp
public:
static bool IsPipeTypeId(
	Document^ document,
	ElementId^ pipeTypeId
)
```
```fsharp
static member IsPipeTypeId :
        document : Document *
        pipeTypeId : ElementId -> bool
```

#### Parameters

document Document
     The document.
pipeTypeId ElementId
     ElementId of the pipe type to check.

#### Return Value

Boolean True if pipe type can used for this pipe, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A type is valid for pipe if it can be used to the pipe element.

#### Reference

Pipe Class

Autodesk.Revit.DB.Plumbing Namespace